[
    {
        "Titre_projet": "Projet Kasa",
        "id": "1",
        "descriptions": [
            {"id_description":"1", "description": "Ceci est la homepage du projet Kasa réaliser en React.JS avec du SASS. Cette page comporte un composant 'Header' avec le logo Kasa puis une navigation permettant d'aller à l'accueil et sur une page avec les mentions légales. Ensuite il y un composant 'Bannière' une image en background puis un titre superposé sur cette même image, il y a aussi en dessous une section comportant chaque 'card' qui est un composant grâce à un .map() je parcours le fichier json à la recherche de toutes les images et titres et je les affiche en propos d'un composant que j'ai appelé 'card_logement'."},
            {"id_description": "2", "description": "Vous voyez sur cette image ci-dessus l'exemple parfait d'une carte logement, elle est composée du composant 'Header' puis d'un composant 'Carrousel' qui affiche les images de la location, ensuite un composant 'InfoLogement' qui sert à afficher les informations de l'utilisateur qui met en location son bien, sa notation et les informations liées au logement. Il y aussi 2 composants 'Dropdown' qui affichent des informations complémentaires (c'est un menu déroulant) et pour finir le dernier composant le 'Footer'.Toutes ces informations sont récupérées grâce à une balise 'Navlink' sur chaque Card qui permet de récupérer les données sur la location que l'utilisateur a choisie sur la homepage"},
            {"id_description": "3", "description": "Sur cette capture d'écran on voit la page de l'erreur 404, j'ai créé la route en spécifiant que les routes qui ne sont pas référencées sont donc redirigé vers la page 404. On peut retrouver sur cette page le même 'Header' que sur les autres pages ainsi que le 'Footer', on a le bouton 'retourné vers 'l'accueil' qui nous ramène vers l'homepage'"},
            {"id_description": "4", "description": "Sur cette image, nous arrivons sur une page de mentions légales etc. nous avons un composant 'bannière' puis 4 composants 'Dropdown' ayant en props les descriptions à afficher, lors de la clique sur le drop down il y a une animation de la flèche qui change de sens et un affichage progressif du dropdown."}    
        ]  
    }
    ,
    {
        "Titre_projet": "Projet Sophie Bluel",
        "id": "2",
        "descriptions": [
            {"id_description":"1", "description": "Pour cette première photo du projet Sophie Bluel il fallait importer les images et les titres qui étaient sur une API pour lequel il fallait faire un appel FETCH pour les récupérer pour ensuite les afficher dynamiquement, les boutons filtres sont aussi à réaliser afin de trier selon la nature de la photo. Tout est réalisé en Javascript"},
            {"id_description": "2", "description": "Sur cette image, on retrouve la page login qui comporte le header de la homepage et un formulaire de login qui sert à se connecter au compte administrateur, cette connexion est réalisée grâce à un appel fetch avec une méthode POST pour pouvoir comparer les données rentrées par l'utilisateur et ceux de l'API. Ensuite, si la connexion était réussit, on était redirigè vers la page d'accueil, mais en tant qu'admin..."},
            {"id_description": "3", "description": "Ceci est la homepage du projet Kasa réaliser en React.JS"},
            {"id_description": "4", "description": "Ceci est la homepage du projet Kasa réaliser en React.JS"},
            {"id_description": "5", "description": "Ceci est la homepage du projet Kasa réaliser en React.JS"},
            {"id_description": "6", "description": "Ceci est la homepage du projet Kasa réaliser en React.JS"}   
        ]  
    }
]


